Tekla.Structures.Model.ISharingLocationsInformation
Provides information about the available sharing locations.

Tekla.Structures.Model.ISharingLocationsInformation.Locations
Gets the collection of available sharing locations.

Tekla.Structures.Model.ISharingLocationsInformation.DefaultLocation
Gets the identifier of the default sharing location.